/*
 * Намерете двуцифрено естествено число xy, за което се въвеждат сборът от цифрите 'x+y' 
 * и разликата между числата 'yx - xy'. 
Да се състави програма на C++, която по въведени сбор и разлика извежда цифрите на числото. 
Пример: Сбор x + y = 12; Разлика yx - xy = 36. 
Изход: 48
Използвайте рекурсия
 */
public class Task15 {

	public static void main(String[] args) {
		int i = 0b10000000000000000000000000000001;
		System.out.println(i);
		 byte k = (byte) 0b10000001;
		 System.out.println(k);

	}

}
