/*
 * Задача 4: Да се изведат на екрана числата от 10 до 1 в обратен
ред.
 */
public class Task04 {

	public static void main(String[] args) {
		
		System.out.println("The numbers from 10 to 1 are: ");

		for (int i = 10; i >= 1; i--) {

			System.out.println(i);
		}

	}

}
